{
  "products": [
    {
      "id": "2547",
      "image": "https://images-static.nykaa.com/media/catalog/product/b/1/b13841c5060542728485.jpg",
      "title": "Charlotte Tilbury Matte Revolution - Pillow Talk Medium",
      "price": 5969,
      "category": "Makeup",
      "description": "This matte lipstick of the future! Matte Revolution lipstick is the revolutionary matte formula in a long-lasting, buildable lipstick, perfect for an effortlessly gorgeous makeup look!What makes it magic?- Get luminous, cashmere-soft lips in a matte finish with a slick of one lipstick- A blend of oils, triglycerides and waxes give you buildable, long-lasting colour for up to 10 hours!"
    },
    {
      "id": "3164",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/e/6/e6807f1EY2913_1.jpg?rnd=20200526195200&tr=w-256",
      "title": "Adi Classic M Grey Running Shoes",
      "category": "Men",
      "price": 1250,
      "description": "Dual color appealing texture mesh with high quality of yarns and fabric. Unique 3 stripes webbing of counter giving different look with low price point shoe. SOLE :- perfect gripping , extra cushioning , light weight and durability of shoe. Extremely light weight 3D bottom Pulse Boost side profile which adds extra cushion on the heel. Sneakers made with this bottom would be pretty comfortable."
    },
    {
      "id": "9103",
      "title": "SAY Blue Color Printed Women Pure Cotton Top & Pyjama Night Suit (Set of 2) (XL)",
      "price": "1040",
      "category": "Female",
      "image": "https://images-static.nykaa.com/media/catalog/product/8/b/8b6e759SAY-NSP-32_1.jpg",
      "description": "This classic night suit will help you set the right tone for any season. Club it up with those fluffy room slippers for a win-win look for leisure hours.Manufacturer:SANSKRUTI EXPORTS.Address:H1 -320, Riico Industrial Area,Jaipur , Rajasthan - 302022"
    },
    {
      "id": "9dfc",
      "title": "GHD Helios Professional Hair Dryer In Plum",
      "price": "22000",
      "category": "Electronics",
      "image": "https://images-static.nykaa.com/media/catalog/product/3/8/38d7325GHDXX00000013_PRIMARY1.jpg",
      "description": "Achieve the perfect blowout from the comfort of your home with the  Ionic 1400W Foldable Hair Dryer with 2 Heat/Speed Settings (VHDH-35). This blow dryer quickly dries the hair and features heat control that reduces frizz."
    },
    {
      "id": "9999",
      "image": "https://images-static.nykaa.com/media/catalog/product/c/6/c6842fa29977_H-8909106016095.jpg",
      "title": "Lakme Showstopper Collection Rouge Bloom Powder Blush - Pink Blossom",
      "price": "899",
      "category": "Makeup",
      "description": "Add a splash of color with the Blush - Rose Ritual (5.2 ml). Formulated to nourish your skin while delivering vibrant color, the long-wearing, lightweight gel-cream blush glides on effortlessly."
    },
    {
      "id": "pfwq",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/a/2/a2b55f1BUL-23BS-42A_1.jpg?rnd=20200526195200&tr=w-256",
      "price": 898,
      "title": "Trendy Colorblock Khaki Causal Shirt for Men",
      "category": "Men",
      "description": "Wear this stylish shirt from the house of BULLMER. It is crafted from high-quality fabric. It features khaki colorblock shirt which has half sleeves, collar neck shirt style with button fly closure. Team it up with loose jeans and sneakers to get the stynning look."
    },
    {
      "id": "kedc",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/b/5/b51bb3fBITTI605JR_1.jpg?rnd=20200526195200&tr=w-256",
      "category": "Female",
      "title": "Womens Georgette Black Embellished Designer Saree",
      "price": "1929",
      "description": "This saree from the house of Akhilam is made from Georgette and is Black in color. Akhilam Ethnic Sarees comes With Blouse Piece, Which can be Stitched according to Your Taste and Preference. This Saree is Crafted by Skill Craftsmen without Compromising on its Quality. With This Beautiful Design and Fabric, This Saree will fetch You Oodles of Compliments and Praise. saree fit size is 5.5 mtr saree and 0.8 mtr blouse, Free Size |."
    },
    {
      "id": "mfdr",
      "image": "https://images-static.nykaa.com/media/catalog/product/3/8/38d7325GHDXX00000004_PRIMARY1.jpg",
      "title": "GHD Chronos Styler Black Straightener",
      "category": "Electronics",
      "price": "34000",
      "description": "This hair straightener styles your hair, adds instant shine and eliminates frizz with charged negative ions. The ceramic-titanium plates of this hair straightener ensure fast heat transfer and provide ultra-smooth gliding for silky hair."
    },
    {
      "id": "3333",
      "image": "https://images-static.nykaa.com/media/catalog/product/b/1/b13841c5060542725378.jpg",
      "category": "Makeup",
      "title": "Charlotte Tilbury Airbrush Flawless Foundation - 4 Neutral",
      "price": "4900",
      "description": "Flawless is a feeling! Charlotte’s new innovation foundation is the secret to a flawless, poreless-looking, confident complexion! A stay all day, weightless, full coverage formula with a natural matte finish! This is a hybrid magic skincare foundation for every occasion! Why? It contains Charlotte’s magic matrix of ingredients!"
    },
    {
      "id": "259c",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/1/1/11ffc4bDSTYLI00034255_2.jpg?rnd=20200526195200&tr=w-256",
      "price": "1725",
      "category": "Men",
      "title": "Men Cargo Jeans Black Cotton",
      "description": "Wear this pair of regular fit cargo jeans from the house of Styli. It is made from high-quality fabric. It features black solid cargo jeans which has straight mid waist rise style and button fly closure. Team it up with t-shirts, casual shirts and white sneakers to complete your look."
    },
    {
      "id": "mndr",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/8/3/8345694CD20221217220926TS-Brown_1.jpg?rnd=20200526195200&tr=w-256",
      "category": "Female",
      "title": "Brown High Waist Pleated Wide Leg Pant",
      "price": "2790",
      "description": "Level up your look with these brown pants from Cider. Crafted from polyester, this stylish pair offers the perfect balance of ease and elegance. Complete the look with a trendy top and sleek wedges."
    },
    {
      "id": "2095",
      "image": "https://images-static.nykaa.com/media/catalog/product/6/c/6c8f65bALANT00000061_2.jpg",
      "price": "4399",
      "title": "Alan Truman No More Split Ends - Automatic Split End Trimmer",
      "category": "Electronics",
      "description": "Say goodbye to split ends and flyaway hair!If split ends had you worried, we have a solution on hand. The Alan Truman NMSE (No More Split Ends) is a perfect solution to excessive split-ends and flyaway hair."
    },
    {
      "id": "1510",
      "image": "https://images-static.nykaa.com/media/catalog/product/0/d/0dc21ecNYKAC00000190-az_1.jpg",
      "title": "Nykaa Black Magic Waterproof & Smudgeproof Mascara",
      "price": "368",
      "category": "Makeup",
      "description": "Extreme Black,Waterproof,Smudgeproof,Mega volume. Maximum length. Major definition. Nykaa's Black Magic Mascara ticks all the boxes. The magic lies in its densely bristled wand, that evenly coats your lashes with extreme black pigment for an ultra-dramatic effect. With a long-wearing formula that glides on like a dream, you can count on this mascara to up your lash game, and how!"
    },
    {
      "id": "3779",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/e/6/e6807f1EY2913_1.jpg?rnd=20200526195200&tr=w-256",
      "title": "INVINCIBLE Black Unisex Pro Sauna Suit (Set of 2) (XL)",
      "category": "Men",
      "price": "1899",
      "description": "NVINCIBLE SAUNA SUIT is a waterproof sauna suit which traps your body heat to increase sweating during workout, training, and fitness exercises. You sweat more than usual, burn more calories. Its close cuff design is more effective to lock the heat."
    },
    {
      "id": "6128",
      "title": "Women Yellow Silk Blend Embroidered Flared Kurta",
      "price": "2880",
      "category": "Female",
      "image": "https://adn-static1.nykaa.com/nykdesignstudio-images/pub/media/catalog/product/5/b/5ba4ae9AHIKA00001366_1.jpg?rnd=20200526195200&tr=w-256",
      "description": "Upgrade your style game with this yellow kurta set from Ahika. Made from high-quality silk, this kurta features flared sleeves, a round neck, drawstring closure, and an embroidered pattern, finished with a mid-waisted trouser and a stylish dupatta. Style it with minimal jewellery and sandals to complete the ensemble."
    }
  ],
  "reviews": [
    {
      "id": "2103",
      "productId": 2095,
      "reviewer": "Zara",
      "text": "Thank you so much nykaa,I m glad I am the first one to write the review for this amazing product.Good Product",
      "rating": 5
    },
    {
      "id": "o0df",
      "productId": 9103,
      "reviewer": "Tanu",
      "text": "nice dress,Great Quality,Value for Money",
      "rating": 5
    },
    {
      "id": "dd82",
      "productId": 3164,
      "reviewer": "Mayank",
      "text": "High quality product",
      "rating": 4
    },
    {
      "id": "45ka",
      "productId": 2547,
      "reviewer": "Siara",
      "text": "Just wow!What a shade What a color What a pigmentation. I love everything about this lipstick it feels luxurious. I loved it",
      "rating": 4
    },
    {
      "id": "gtks",
      "productId": null,
      "reviewer": "Mahi",
      "text": "Not Good At all",
      "rating": 3
    },
    {
      "id": "nksz",
      "productId": 6128,
      "reviewer": "Neha",
      "text": "Material was average",
      "rating": 3
    },
    {
      "id": "342a",
      "productId": 2547,
      "reviewer": "maria",
      "text": "Best Best Best....",
      "rating": 5
    },
    {
      "id": "0ad5",
      "productId": 3164,
      "reviewer": "krish",
      "text": "avg",
      "rating": 2
    },
    {
      "id": "a55d",
      "productId": null,
      "reviewer": "safa",
      "text": "so so",
      "rating": 1
    }
  ]
}